Ran Plan for dir: `eks-vpc` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_route_table_association.public[0] must be replaced
-/+ resource "aws_route_table_association" "public" {
      ~ id             = "rtbassoc-03bb4545de533be5c" -> (known after apply)
      ~ subnet_id      = "subnet-02c01cceebbba55b6" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_route_table_association.public[1] must be replaced
-/+ resource "aws_route_table_association" "public" {
      ~ id             = "rtbassoc-0eb70153e836c4e6c" -> (known after apply)
      ~ subnet_id      = "subnet-0899fec9973b4b08b" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_route_table_association.public[2] must be replaced
-/+ resource "aws_route_table_association" "public" {
      ~ id             = "rtbassoc-0c79fe47ce380c9da" -> (known after apply)
      ~ subnet_id      = "subnet-01796229a152460d3" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_subnet.private[0] must be replaced
-/+ resource "aws_subnet" "private" {
      ~ arn                                            = "arn:aws:ec2:ap-southeast-1:637423549122:subnet/subnet-08eedad8103b66bff" -> (known after apply)
      ~ availability_zone                              = "ap-southeast-1c" -> "ap-southeast-1a" # forces replacement
      ~ availability_zone_id                           = "apse1-az3" -> (known after apply)
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-08eedad8103b66bff" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "637423549122" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Attributes"  = "vpc"
            "Environment" = "test"
            "ManagedBy"   = "terraform"
            "Name"        = "Private-Subnet-0"
            "Owner"       = "team-sre"
            "TFProject"   = "github.com/tampubolon/pintu-infra/eks-vpc"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_subnet.private[1] must be replaced
-/+ resource "aws_subnet" "private" {
      ~ arn                                            = "arn:aws:ec2:ap-southeast-1:637423549122:subnet/subnet-0633d51e17dc49181" -> (known after apply)
      ~ availability_zone                              = "ap-southeast-1a" -> "ap-southeast-1b" # forces replacement
      ~ availability_zone_id                           = "apse1-az2" -> (known after apply)
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-0633d51e17dc49181" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "637423549122" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Attributes"  = "vpc"
            "Environment" = "test"
            "ManagedBy"   = "terraform"
            "Name"        = "Private-Subnet-1"
            "Owner"       = "team-sre"
            "TFProject"   = "github.com/tampubolon/pintu-infra/eks-vpc"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_subnet.private[2] must be replaced
-/+ resource "aws_subnet" "private" {
      ~ arn                                            = "arn:aws:ec2:ap-southeast-1:637423549122:subnet/subnet-0833540ccc82f61ed" -> (known after apply)
      ~ availability_zone                              = "ap-southeast-1a" -> "ap-southeast-1c" # forces replacement
      ~ availability_zone_id                           = "apse1-az2" -> (known after apply)
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-0833540ccc82f61ed" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "637423549122" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Attributes"  = "vpc"
            "Environment" = "test"
            "ManagedBy"   = "terraform"
            "Name"        = "Private-Subnet-2"
            "Owner"       = "team-sre"
            "TFProject"   = "github.com/tampubolon/pintu-infra/eks-vpc"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_subnet.public[0] must be replaced
-/+ resource "aws_subnet" "public" {
      ~ arn                                            = "arn:aws:ec2:ap-southeast-1:637423549122:subnet/subnet-02c01cceebbba55b6" -> (known after apply)
      ~ availability_zone                              = "ap-southeast-1b" -> "ap-southeast-1a" # forces replacement
      ~ availability_zone_id                           = "apse1-az1" -> (known after apply)
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-02c01cceebbba55b6" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "637423549122" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Attributes"  = "vpc"
            "Environment" = "test"
            "ManagedBy"   = "terraform"
            "Name"        = "Public-Subnet-0"
            "Owner"       = "team-sre"
            "TFProject"   = "github.com/tampubolon/pintu-infra/eks-vpc"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_subnet.public[1] must be replaced
-/+ resource "aws_subnet" "public" {
      ~ arn                                            = "arn:aws:ec2:ap-southeast-1:637423549122:subnet/subnet-0899fec9973b4b08b" -> (known after apply)
      ~ availability_zone                              = "ap-southeast-1c" -> "ap-southeast-1b" # forces replacement
      ~ availability_zone_id                           = "apse1-az3" -> (known after apply)
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-0899fec9973b4b08b" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "637423549122" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Attributes"  = "vpc"
            "Environment" = "test"
            "ManagedBy"   = "terraform"
            "Name"        = "Public-Subnet-1"
            "Owner"       = "team-sre"
            "TFProject"   = "github.com/tampubolon/pintu-infra/eks-vpc"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_subnet.public[2] must be replaced
-/+ resource "aws_subnet" "public" {
      ~ arn                                            = "arn:aws:ec2:ap-southeast-1:637423549122:subnet/subnet-01796229a152460d3" -> (known after apply)
      ~ availability_zone                              = "ap-southeast-1a" -> "ap-southeast-1c" # forces replacement
      ~ availability_zone_id                           = "apse1-az2" -> (known after apply)
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-01796229a152460d3" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "637423549122" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Attributes"  = "vpc"
            "Environment" = "test"
            "ManagedBy"   = "terraform"
            "Name"        = "Public-Subnet-2"
            "Owner"       = "team-sre"
            "TFProject"   = "github.com/tampubolon/pintu-infra/eks-vpc"
        }
        # (9 unchanged attributes hidden)
    }

Plan: 9 to add, 0 to change, 9 to destroy.

Changes to Outputs:
~ private_subnet_0_id = "subnet-08eedad8103b66bff" -> (known after apply)
~ private_subnet_1_id = "subnet-0633d51e17dc49181" -> (known after apply)
~ private_subnet_2_id = "subnet-0833540ccc82f61ed" -> (known after apply)
~ public_subnet_0_id  = "subnet-02c01cceebbba55b6" -> (known after apply)
~ public_subnet_1_id  = "subnet-0899fec9973b4b08b" -> (known after apply)
~ public_subnet_2_id  = "subnet-01796229a152460d3" -> (known after apply)
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d eks-vpc`
* :put_litter_in_its_place: To **delete** this plan click [here](https://1688-13-212-101-106.ngrok-free.app/lock?id=tampubolon%252Fpintu-infra%252Feks-vpc%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d eks-vpc`
</details>
Plan: 9 to add, 0 to change, 9 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To **delete** all plans and locks for the PR, comment:
    * `atlantis unlock`